tandge/LowSightFace/esp32_src/CameraWebServer/app_httpd.cpp
static esp_err_t pll_handler(httpd_req_t *req) {
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int bypass = parse_get_var(buf, "bypass", 0);
  int mul = parse_get_var(buf, "mul", 0);
  int sys = parse_get_var(buf, "sys", 0);
  int root = parse_get_var(buf, "root", 0);
  int pre = parse_get_var(buf, "pre", 0);
  int seld5 = parse_get_var(buf, "seld5", 0);
  int pclken = parse_get_var(buf, "pclken", 0);
  int pclk = parse_get_var(buf, "pclk", 0);
  free(buf);

  log_i("Set Pll: bypass: %d, mul: %d, sys: %d, root: %d, pre: %d, seld5: %d, pclken: %d, pclk: %d", bypass, mul, sys, root, pre, seld5, pclken, pclk);
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_pll(s, bypass, mul, sys, root, pre, seld5, pclken, pclk);
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t win_handler(httpd_req_t *req) {
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int startX = parse_get_var(buf, "sx", 0);
  int startY = parse_get_var(buf, "sy", 0);
  int endX = parse_get_var(buf, "ex", 0);
  int endY = parse_get_var(buf, "ey", 0);
  int offsetX = parse_get_var(buf, "offx", 0);
  int offsetY = parse_get_var(buf, "offy", 0);
  int totalX = parse_get_var(buf, "tx", 0);
  int totalY = parse_get_var(buf, "ty", 0);  // codespell:ignore totaly
  int outputX = parse_get_var(buf, "ox", 0);
  int outputY = parse_get_var(buf, "oy", 0);
  bool scale = parse_get_var(buf, "scale", 0) == 1;
  bool binning = parse_get_var(buf, "binning", 0) == 1;
  free(buf);

  log_i(
    "Set Window: Start: %d %d, End: %d %d, Offset: %d %d, Total: %d %d, Output: %d %d, Scale: %u, Binning: %u", startX, startY, endX, endY, offsetX, offsetY,
    totalX, totalY, outputX, outputY, scale, binning  // codespell:ignore totaly
  );
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_res_raw(s, startX, startY, endX, endY, offsetX, offsetY, totalX, totalY, outputX, outputY, scale, binning);  // codespell:ignore totaly
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t index_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
  sensor_t *s = esp_camera_sensor_get();
  if (s != NULL) {
    if (s->id.PID == OV3660_PID) {
      return httpd_resp_send(req, (const char *)index_ov3660_html_gz, index_ov3660_html_gz_len);
    } else if (s->id.PID == OV5640_PID) {
      return httpd_resp_send(req, (const char *)index_ov5640_html_gz, index_ov5640_html_gz_len);
    } else {
      return httpd_resp_send(req, (const char *)index_ov2640_html_gz, index_ov2640_html_gz_len);
    }
  } else {
    log_e("Camera sensor not found");
    return httpd_resp_send_500(req);
  }
}

static esp_err_t cors_options_handler(httpd_req_t *req) {
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Methods", "GET, OPTIONS");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Headers", "Content-Type, X-Timestamp");
  httpd_resp_set_hdr(req, "Access-Control-Max-Age", "86400");
  httpd_resp_send(req, NULL, 0);
  return ESP_OK;
}

// Helper: extract base64 from PEM and decode to DER
static uint8_t *pem_to_der(const char *pem_buf, const char *header, const char *footer, size_t *der_len) {
  const char *start = strstr(pem_buf, header);
  if (!start) return NULL;
  start += strlen(header);
  if (*start == '\r') start++;
  if (*start == '\n') start++;
  else return NULL;

  const char *end = strstr(start, footer);
  if (!end || end <= start) return NULL;

  // Count base64 chars (skip \r \n)
  size_t b64_len = 0;
  for (const char *p = start; p < end; p++) {
    if (*p != '\r' && *p != '\n') b64_len++;
  }
  if (b64_len == 0) return NULL;

  // Build contiguous base64 string
  char *b64 = (char *)malloc(b64_len + 1);
  if (!b64) return NULL;
  size_t j = 0;
  for (const char *p = start; p < end; p++) {
    if (*p != '\r' && *p != '\n') b64[j++] = *p;
  }
  b64[b64_len] = '\0';

  // Allocate DER buffer (b64_len is more than enough for decoded output)
  uint8_t *der = (uint8_t *)malloc(b64_len);
  if (!der) { free(b64); return NULL; }

  size_t olen;
  int ret = mbedtls_base64_decode(der, b64_len, &olen, (const unsigned char *)b64, b64_len);
  free(b64);
  if (ret != 0) {
    free(der);
    log_e("base64 decode failed: -0x%04x", -ret);
    return NULL;
  }

  *der_len = olen;
  return der;
}

void startCameraServer() {
  // ---- Split combined PEM into NULL-terminated cert + key ----
  const char *key_marker = "-----BEGIN PRIVATE KEY-----";
  size_t marker_len = strlen(key_marker);
  const char *pem = (const char *)esp32_ssl_cert_esp32_server_pem;
  size_t pem_len = esp32_ssl_cert_esp32_server_pem_len;
  size_t cert_len = pem_len;
  for (size_t i = 0; i < pem_len - marker_len; i++) {
    if (memcmp(pem + i, key_marker, marker_len) == 0) { cert_len = i; break; }
  }
  size_t key_len = pem_len - cert_len;

  char *cert_buf = (char *)malloc(cert_len + 1);
  char *key_buf  = (char *)malloc(key_len + 1);
  if (!cert_buf || !key_buf) {
    log_e("malloc failed for cert/key buffers");
    if (cert_buf) free(cert_buf);
    if (key_buf) free(key_buf);
    return;
  }
  memcpy(cert_buf, pem, cert_len); cert_buf[cert_len] = '\0';
  memcpy(key_buf, pem + cert_len, key_len); key_buf[key_len] = '\0';
  log_i("PEM cert: %u bytes, key: %u bytes", cert_len, key_len);

  // ---- Convert PEM to DER (avoids strstr issues in transport layer) ----
  size_t cert_der_len = 0, key_der_len = 0;
  uint8_t *cert_der = pem_to_der(cert_buf, "-----BEGIN CERTIFICATE-----", "-----END CERTIFICATE-----", &cert_der_len);
  uint8_t *key_der  = pem_to_der(key_buf,  "-----BEGIN PRIVATE KEY-----",  "-----END PRIVATE KEY-----",  &key_der_len);
  free(cert_buf);
  free(key_buf);

  if (!cert_der || !key_der) {
    log_e("PEM-to-DER conversion failed");
    if (cert_der) free(cert_der);
    if (key_der) free(key_der);
    return;
  }
  log_i("DER cert: %u bytes, key: %u bytes", cert_der_len, key_der_len);

  // ---- Main HTTPS server (port 443) ----
  httpd_ssl_config_t config = HTTPD_SSL_CONFIG_DEFAULT();
  config.httpd.max_uri_handlers = 17;
  config.httpd.server_port = 443;
  config.servercert = cert_der;
  config.servercert_len = cert_der_len;
  config.prvtkey_pem = key_der;
  config.prvtkey_len = key_der_len;

  httpd_uri_t index_uri = {
    .uri = "/",
    .method = HTTP_GET,
    .handler = index_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t status_uri = {
    .uri = "/status",
    .method = HTTP_GET,
    .handler = status_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t cmd_uri = {
    .uri = "/control",
    .method = HTTP_GET,
    .handler = cmd_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t capture_uri = {
    .uri = "/capture",
    .method = HTTP_GET,
    .handler = capture_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

