tandge/LowSightFace/esp32_src/CameraWebServer/app_httpd.cpp
  httpd_uri_t stream_uri = {
    .uri = "/stream",
    .method = HTTP_GET,
    .handler = stream_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t bmp_uri = {
    .uri = "/bmp",
    .method = HTTP_GET,
    .handler = bmp_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t xclk_uri = {
    .uri = "/xclk",
    .method = HTTP_GET,
    .handler = xclk_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t reg_uri = {
    .uri = "/reg",
    .method = HTTP_GET,
    .handler = reg_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t greg_uri = {
    .uri = "/greg",
    .method = HTTP_GET,
    .handler = greg_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t pll_uri = {
    .uri = "/pll",
    .method = HTTP_GET,
    .handler = pll_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t win_uri = {
    .uri = "/resolution",
    .method = HTTP_GET,
    .handler = win_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = true,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t cors_uri = {
    .uri = "/*",
    .method = HTTP_OPTIONS,
    .handler = cors_options_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = false,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
  };

  ra_filter_init(&ra_filter, 20);

  log_i("Starting HTTPS server on port %u ...", config.httpd.server_port);
  esp_err_t err = httpd_ssl_start(&camera_httpd, &config);
  if (err != ESP_OK) {
    log_e("HTTPS server start FAILED! err=0x%x", err);
    free(cert_der); free(key_der);
    return;
  }
  log_i("HTTPS server started OK");

  httpd_register_uri_handler(camera_httpd, &cors_uri);
  httpd_register_uri_handler(camera_httpd, &index_uri);
  httpd_register_uri_handler(camera_httpd, &cmd_uri);
  httpd_register_uri_handler(camera_httpd, &status_uri);
  httpd_register_uri_handler(camera_httpd, &capture_uri);
  httpd_register_uri_handler(camera_httpd, &bmp_uri);
  httpd_register_uri_handler(camera_httpd, &xclk_uri);
  httpd_register_uri_handler(camera_httpd, &reg_uri);
  httpd_register_uri_handler(camera_httpd, &greg_uri);
  httpd_register_uri_handler(camera_httpd, &pll_uri);
  httpd_register_uri_handler(camera_httpd, &win_uri);

  // ---- Stream HTTPS server (port 444) ----
  httpd_ssl_config_t stream_config = HTTPD_SSL_CONFIG_DEFAULT();
  stream_config.httpd.server_port = 444;
  stream_config.httpd.ctrl_port = 32769;
  stream_config.httpd.max_uri_handlers = 4;
  stream_config.servercert = cert_der;
  stream_config.servercert_len = cert_der_len;
  stream_config.prvtkey_pem = key_der;
  stream_config.prvtkey_len = key_der_len;

  log_i("Starting stream HTTPS server on port %u ...", stream_config.httpd.server_port);
  err = httpd_ssl_start(&stream_httpd, &stream_config);
  if (err != ESP_OK) {
    log_e("Stream HTTPS server start FAILED! err=0x%x", err);
    free(cert_der); free(key_der);
    return;
  }
  httpd_register_uri_handler(stream_httpd, &stream_uri);
  log_i("Stream HTTPS server started OK");
}

void setupLedFlash() {
#if defined(LED_GPIO_NUM)
  ledcAttach(LED_GPIO_NUM, 5000, 8);
#else
  log_i("LED flash is disabled -> LED_GPIO_NUM undefined");
#endif
}
